backend/controllers/ContentController.php

	public function actionCreate()
	{
		$model = new Content();

		if ($model->load(Yii::$app->request->post())) {

			$model->user_id = Yii::$app->user->id;

			if ($model->saveContent()) {
---
INSERT INTO `content` (`title`, `lead`, `content`, `slug`, `seo_title`, `seo_meta_desc`, `status`, `published_at`, `comment`, `user_id`, `created_at`, `updated_at`) VALUES ('Test content', '<p>Lead content</p>', '', 'test-content', '', '', 'public', '2014-11-19 13:45', 0, 1, NOW(), NOW())

	protected function findModel($id)
	{
		if (($model = Content::findOne($id)) !== null) {
---
SELECT * FROM `content` WHERE `id`='4'