backend/controllers/FormController.php

UPDATE `field` SET `deleted_at`='2014-11-05 01:22:41' WHERE form_id = 4
---
	public function actionUpdate($id)
	{
		$model = $this->findModel($id);

		$fields = [];

		$connection = \Yii::$app->db;
		$transaction = $connection->beginTransaction();

		try {
			//Delete all the fields
			Field::updateAll(['deleted_at' => date('Y-m-d H:i:s')],'form_id = '.$id);

SELECT * FROM `form` WHERE `id`='4'
---
	protected function findModel($id)
	{
		if (($model = Form::findOne($id)) !== null) {