backend/controllers/PollController.php

SELECT * FROM `answer` WHERE `id`='8'
UPDATE `answer` SET `position`=1 WHERE (`id`=8) AND (`poll_id`=2)
---
	private function createUpdateModel(&$model, &$answers) {

		$save = true;

		if ($model->load(Yii::$app->request->post()) && $model->save()) {

			$pos = 1;
			$ans_ids = $del_ids = [];

			foreach (Yii::$app->request->post("Answer")['answer'] as $key => $ans) {

				if (!empty(Yii::$app->request->post("Answer")['id'][$key])) {
					$answer = Answer::findOne(Yii::$app->request->post("Answer")['id'][$key]);
					$ans_ids[] = Yii::$app->request->post("Answer")['id'][$key];
				} else {
					$answer = new Answer();
					$answer->poll_id = $model->id;
				}

				$answer->answer = strip_tags($ans);
				$answer->position = $pos++;

				$caller = next(debug_backtrace())['function'];

				if (!empty($answer->id)) {
					//Update
					if ($answer->update() !== false) {
						if ($model->update() === false) {

SELECT `id`, `question`, `status`, `status_on`, `status_on_time`, `status_off`, `status_off_time`, `created_at`, `updated_at` FROM `poll` WHERE deleted_at IS NULL AND id = 2
---
	protected function findModel($id)
	{
		$model = Poll::find()
			->select(['id','question', 'status', 'status_on','status_on_time','status_off','status_off_time', 'created_at','updated_at'])
			->where('deleted_at IS NULL AND id = '.$id)->one();