backend/controllers/UserController.php

	protected function findModel($id)
	{
		$model = User::find()
			->where('deleted_at IS NULL AND id = '.$id)->one();
---
SELECT * FROM `user` WHERE deleted_at IS NULL AND id = 5