common/models/Answer.php

    public function getVotesNum($id)
    {
    	return Vote::find()
			->select(['answer','answer.id','COUNT(vote.id) AS votes_num'])
			->joinWith('answer', true, 'RIGHT JOIN')
			->where('poll_id = '.$id.' AND deleted_at IS NULL ')
			->groupBy(['answer.id'])
			->orderBy('position')
			->all();
---
SELECT `answer`, `answer`.`id`, COUNT(vote.id) AS votes_num FROM `vote` RIGHT JOIN `answer` ON `vote`.`answer_id` = `answer`.`id` WHERE poll_id = 2 AND deleted_at IS NULL  GROUP BY `answer`.`id` ORDER BY `position`

    public function getVotesNumAll($id)
    {
    	$all = Vote::find()
    		->joinWith('answer')
			->where('poll_id = '.$id)
			->count('1');
---
SELECT COUNT(1) FROM `vote` LEFT JOIN `answer` ON `vote`.`answer_id` = `answer`.`id` WHERE poll_id = 2