common/models/Content.php

INSERT INTO `content` (`title`, `lead`, `content`, `slug`, `seo_title`, `seo_meta_desc`, `status`, `published_at`, `comment`, `user_id`, `created_at`, `updated_at`) VALUES ('test content with tags', '<p style=\"text-align: left;\">asdf asdf sadf sadf asdf 23 123 123</p>', '', 'test-content-with-tags', '', '', 'public', NULL, 0, 1, NOW(), NOW())
---
	public function saveContent() {
		$connection = \Yii::$app->db;
		$transaction = $connection->beginTransaction();

		try {

			$save = true;

			if ($this->save()) {