common/models/ContentTag.php

    public static function deleteContentTag($content_id) {
    	return ContentTag::deleteAll('content_id = ' . $content_id);
---
DELETE FROM `content_tag` WHERE 4

	public static function saveContentTag($model_id, $tag_id)
	{
		$contentTag = new ContentTag();
		$contentTag->content_id = $model_id;
		$contentTag->tag_id = $tag_id;
		return $contentTag->save();
---
INSERT INTO `content_tag` (`content_id`, `tag_id`) VALUES (4, 11)