common/models/Poll.php

	public function getAnswersIds()
    {
    	return Answer::find()
			->select(['id'])
			->where('deleted_at IS NULL AND poll_id = '.$this->id)
			->asArray()
			->all();
---
SELECT `id` FROM `answer` WHERE deleted_at IS NULL AND poll_id = 2