common/models/Tag.php

SELECT `id`, `name` FROM `tag` WHERE (`deleted_at` IS NULL) AND (`name` IN ('valami', 'új cimke', 'test tag'))
---
	public static function getTagsByName($name = array()) {
		return Tag::find()
			->select(['id', 'name'])
			->where(['deleted_at' => null])
			->andFilterWhere(['in', 'name', $name])
			->asArray()
			->all();

INSERT INTO `tag` (`name`, `slug`, `created_at`, `updated_at`) VALUES ('test tag', 'test-tag', NOW(), NOW())
---
	public static function createTag($name)
	{
		$tag = new Tag();
		$tag->name = $name;
		$tag->slug = $name;

		if ($tag->save()) {