common/models/User.php

SELECT * FROM `user` WHERE (`id`=1) AND (`deleted_at` IS NULL)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id , 'deleted_at' => null]);

SELECT * FROM `user` WHERE (`email`='admin@site.com') AND (`deleted_at` IS NULL)
---
    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'deleted_at' => null]);